import 'package:flutter/material.dart';

import '../models/models.dart';

class detaprovider extends ChangeNotifier {
  Color red = Colors.red;
  Color blue = Colors.blue;
  Color gray = Colors.grey;

  List<Product> products = [
    Product(
        id: 1,
        price: 59,
        title: "سماعات لاسلكية",
        subTitle: "جودة صوت عالية",
        image: "images/airpod.png",
        description:
            'أدى النمو المستمر في صناعة الهواتف الذكية المحمولة حول العالم، إلى زيادة الطلب على الإكسسوارات المرتبطة به.'
            'سواء واقي الشاشة أو الأغطية الخارجية المختلفة للهاتف وكذلك سماعات الأذن وغيرها من الإكسسوارات الأخرى.'
            'وتعتبر صناعة مستلزمات الهواتف المحمولة من الصناعات المتطورة بشكل سريع جدًا خلال الفترة الأخيرة، لذا جاءت ضمن افضل منتجات للبيع اون لاين في قائمتنا.'),
    Product(
        id: 2,
        price: 1099,
        title: "جهاز موبايل",
        subTitle: "وأصبح للموبايل قوة",
        image: "images/mobile.png",
        description:
            'أدى النمو المستمر في صناعة الهواتف الذكية المحمولة حول العالم، إلى زيادة الطلب على الإكسسوارات المرتبطة به.'
            'سواء واقي الشاشة أو الأغطية الخارجية المختلفة للهاتف وكذلك سماعات الأذن وغيرها من الإكسسوارات الأخرى.'
            'وتعتبر صناعة مستلزمات الهواتف المحمولة من الصناعات المتطورة بشكل سريع جدًا خلال الفترة الأخيرة، لذا جاءت ضمن افضل منتجات للبيع اون لاين في قائمتنا.'),
    Product(
        id: 3,
        price: 39,
        title: "نظارات ثلاثية الأبعاد",
        subTitle: "لنقلك للعالم الافتراضي",
        image: "images/class.png",
        description:
            'أدى النمو المستمر في صناعة الهواتف الذكية المحمولة حول العالم، إلى زيادة الطلب على الإكسسوارات المرتبطة به.'
            'سواء واقي الشاشة أو الأغطية الخارجية المختلفة للهاتف وكذلك سماعات الأذن وغيرها من الإكسسوارات الأخرى.'
            'وتعتبر صناعة مستلزمات الهواتف المحمولة من الصناعات المتطورة بشكل سريع جدًا خلال الفترة الأخيرة، لذا جاءت ضمن افضل منتجات للبيع اون لاين في قائمتنا.'),
    Product(
        id: 4,
        price: 56,
        title: "سماعات",
        subTitle: "لساعات استماع طويلة",
        image: "images/headset.png",
        description:
            'أدى النمو المستمر في صناعة الهواتف الذكية المحمولة حول العالم، إلى زيادة الطلب على الإكسسوارات المرتبطة به.'
            'سواء واقي الشاشة أو الأغطية الخارجية المختلفة للهاتف وكذلك سماعات الأذن وغيرها من الإكسسوارات الأخرى.'
            'وتعتبر صناعة مستلزمات الهواتف المحمولة من الصناعات المتطورة بشكل سريع جدًا خلال الفترة الأخيرة، لذا جاءت ضمن افضل منتجات للبيع اون لاين في قائمتنا.'),
    Product(
        id: 5,
        price: 68,
        title: "مسجل صوت",
        subTitle: "سجل اللحظات المهمة حولك",
        image: "images/speaker.png",
        description:
            'أدى النمو المستمر في صناعة الهواتف الذكية المحمولة حول العالم، إلى زيادة الطلب على الإكسسوارات المرتبطة به.'
            'سواء واقي الشاشة أو الأغطية الخارجية المختلفة للهاتف وكذلك سماعات الأذن وغيرها من الإكسسوارات الأخرى.'
            'وتعتبر صناعة مستلزمات الهواتف المحمولة من الصناعات المتطورة بشكل سريع جدًا خلال الفترة الأخيرة، لذا جاءت ضمن افضل منتجات للبيع اون لاين في قائمتنا.'),
    Product(
        id: 6,
        price: 39,
        title: "كاميرات كمبيوتر",
        subTitle: "بجودة ودقة صورة عالية",
        image: "images/camera.png",
        description:
            'أدى النمو المستمر في صناعة الهواتف الذكية المحمولة حول العالم، إلى زيادة الطلب على الإكسسوارات المرتبطة به.'
            'سواء واقي الشاشة أو الأغطية الخارجية المختلفة للهاتف وكذلك سماعات الأذن وغيرها من الإكسسوارات الأخرى.'
            'وتعتبر صناعة مستلزمات الهواتف المحمولة من الصناعات المتطورة بشكل سريع جدًا خلال الفترة الأخيرة، لذا جاءت ضمن افضل منتجات للبيع اون لاين في قائمتنا.'),
  ];
}
